app/controllers/user_details_controller.rb

  def index
    @user_details = UserDetail.all
---
SELECT "user_details".* FROM "user_details"

  def create
    @user_detail = UserDetail.new(user_detail_params)

    respond_to do |format|
      if @user_detail.save
---
INSERT INTO "user_details" ("user_id", "title", "name", "email", "dob", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 2], ["title", "afags"], ["name", "gdfg"], ["email", "dsfg"], ["dob", Wed, 07 Sep 2016], ["created_at", 2016-09-07 23:37:21 UTC], ["updated_at", 2016-09-07 23:37:21 UTC]]

  def update
    respond_to do |format|
      if @user_detail.update(user_detail_params)
---
UPDATE "user_details" SET "email" = ?, "updated_at" = ? WHERE "user_details"."id" = ?  [["email", "sdfsfsdfsdfs"], ["updated_at", 2016-09-08 18:56:34 UTC], ["id", 6]]

  def destroy
    @user_detail.destroy
---
DELETE FROM "user_details" WHERE "user_details"."id" = ?  [["id", 1]]

    def set_user_detail
      @user_detail = UserDetail.find(params[:id])
---
SELECT  "user_details".* FROM "user_details" WHERE "user_details"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]